				{"type":"web", "description":"XSS STOCKE","resume":"Le site est vulnérable au Cross Site Scripting (XSS) stocké.","impact":"Le XSS stocké est un problème dangereux qui a de nombreux vecteurs d'exploitation du fait de la persistance des informations injectées, dont certains incluent :Les informations sensibles de la session de l'utilisateur, telles que les cookies, peuvent être volées par transfert transparent vers un serveur de récupération.	XSS peut faire tourner en tâche de fond des scripts malveillants tels des backdoors, injecter des commandes OS, etc.Le site peut être redirigé vers un nouvel emplacement, endommagé ou utilisé comme site d'hameçonnage","riskrating":"Critique", "recommandation":"	Réaliser un double validation (côté client/côté serveur) de toute valeur issue de champ de formulaire soumis par l’utilisateur afin de s’assurer que l’information est conforme au type, à la longueur, à la signature attendue	Contextualiser l’affichage de contenu sur UI par des fonctions spéciales permettant d’échapper les caractères interdits tels html_special_chars() ou l’équivalent dans votre moteur de génération de contenus	Ecrire une politique CSP (Content Security Policy)	Intégrer côté serveur l’entête X-XSS-Protection avec l’attribut mode=block (Compatibilité avec la majorité des navigateurs sauf Firefox)"},
				{"type":"web", "description":"XSS REFLECHI","resume":"Le site est vulnérable au Cross Site Scripting (XSS) réfléchi","impact":"Réaliser un double validation (côté client/côté serveur) de toute valeur issue d’argument d’url , soumis par l’utilisateur afin de s’assurer que l’information est conforme au type, à la longueur, à la signature attendue	Contextualiser l’affichage de contenu sur UI par des fonctions spéciales permettant d’échapper les caractères interdits tels html_special_chars() ou l’équivalent dans votre moteur de génération de contenus	Ecrire une politique CSP (Content Security Policy)	Intégrer côté serveur l’entête X-XSS-Protection avec l’attribut mode=block (Compatibilité avec la majorité des navigateurs sauf Firefox)","riskrating":"Elevé", "recommandation":"Génerer un token unique avec une très grande entropie  sur les pages intégrant des formulaires sensibles expirant après chaque soumission des formulaires en questionSoumettre les formulaires en POSTIntégrer des popups de confirmation de certaines actions sensibles(optionnel) Intégrer des captcha via des plugins ou self développement  aux pages intégrant des formulaires sensibles."},
				{"type":"web", "description":"SQL Injection","resume":"Le site est vulnérable au Cross Site Scripting (XSS) stocké.","impact":"Le XSS stocké est un problème dangereux qui a de nombreux vecteurs d'exploitation du fait de la persistance des informations injectées, dont certains incluent :Les informations sensibles de la session de l'utilisateur, telles que les cookies, peuvent être volées par transfert transparent vers un serveur de récupération.	XSS peut faire tourner en tâche de fond des scripts malveillants tels des backdoors, injecter des commandes OS, etc.Le site peut être redirigé vers un nouvel emplacement, endommagé ou utilisé comme site d'hameçonnage","riskrating":"Critique", "recommandation":"	Réaliser un double validation (côté client/côté serveur) de toute valeur issue de champ de formulaire soumis par l’utilisateur afin de s’assurer que l’information est conforme au type, à la longueur, à la signature attendue	Contextualiser l’affichage de contenu sur UI par des fonctions spéciales permettant d’échapper les caractères interdits tels html_special_chars() ou l’équivalent dans votre moteur de génération de contenus	Ecrire une politique CSP (Content Security Policy)	Intégrer côté serveur l’entête X-XSS-Protection avec l’attribut mode=block (Compatibilité avec la majorité des navigateurs sauf Firefox)"},
				{"type":"web", "description":"LISTAGE DE REPERTOIRE","resume":"Le serveur permet l’accessibilité de certains répertoires par navigation suivant une/plusieurs urls données.","impact":"Un potentiel attaquant pourrait accéder à ces répertoire, consulter les ressources disponible et collecter des informations sensibles.","riskrating":"Critique", "recommandation":"	S’assurer que le serveur web en cours d’utilisation pour le projet courant est à jourConfigurer le serveur web afin de désactiver le listage de répertoire"},
				{"type":"web", "description":"MIME SNIFFING","resume":"Nous avons remarqué certaines requêtes vulnérables au mime sniffing","impact":"Le sniffing de type MIME est une fonctionnalité standard dans les navigateurs pour trouver un moyen approprié de rendre les données où les en-têtes HTTP envoyés par le serveur ne sont pas concluants ou manquant. Cela permet aux anciennes versions d'Internet Explorer et de Chrome d'effectuer un reniflage MIME sur le corps de la réponse, ce qui peut entraîner l'interprétation du corps de la réponse et afficher comme un type de contenu autre que le type de contenu prévu. Le problème se pose dès qu'un site web permet aux utilisateurs de télécharger du contenu qui est ensuite publié sur le serveur web. Si un attaquant peut effectuer XSS (Cross-site Scripting) attaquer en manipulant le contenu de manière à être accepté par l'application web et rendu en HTML par le navigateur, il est possible d'injecter du code.","riskrating":"Elevé", "recommandation":"	Ajouter l’entête Content-Type pour chaque réponse serveur en fonction du contenu attendu."},
				{"type":"web", "description":"DIRECTIVE SAMECOOKIE NON IMPLEMENTEE","resume":"Nous avons remarqué une non implémentation de l’attribut SameSite lors de la génération des cookies par le serveur. Les cookies de même site permettent aux serveurs d'atténuer le risque de vol de cookie et de fuite d'informations en affirmant qu'un cookie particulier ne doit être envoyé qu'avec des requêtes initiées à partir du domaine inhérent au projet","impact":"Lorsque la directive est non implémentée, les cookies sont généralement envoyés à des tiers dans le cadre de demandes d'origine croisée. Cela peut être abusé pour faire des attaques CSRF puisqu’elles diffusent les cookies utilisés dans la session courante.","riskrating":"Elevé", "recommandation":"Ajouter l’attribut SameSite pendant l’initialisation d’un nouveau cookie par le serveur dans l’entête set-Cookie"},
				{"type":"system", "description":"DETECTION IPV6 ACTIVE","resume":"Le service IPV6 est activé. Dans le cas où les stratégies implémentées sur IPV4 ne le sont pas sur IPV6, les serveurs concernés serait compromis d’un point de vue réseau","impact":"Compromission probable des règles de firewall et de l’accessibilité aux services.","riskrating":"Faible", "recommandation":"Désactiver ipv6"},
				{"type":"system", "description":"ICMP REDIRECT","resume":"Détection de paramétrages indiquant l'acceptance de redirections ICMP","impact":"Possibilité de redirection et attaque de l’homme du milieu.","riskrating":"Elevé", "recommandation":"Le blocage les messages ICMP de redirection (ICMP redirect)."},
				{"type":"system", "description":"SERVICE ELASTIC SEARCH ACCESSIBLE SANS AUTHENTIFICATION","resume":"accessibilité et possibilité de paramétrer entièrement et sans accès conditionné par  un challenge login/mot de passe ou de filtrage réseau le service elasticsearch.","impact":"L’accès sans restriction au service elasticsearch pourrait conduire à une collecte de données sensibles, stratégiques, personnelles. Un eventuel attaquant pourrait corrompre les données ou provoquer une indisponibilité totale du système en supprimant toutes les index.","riskrating":"Critique", "recommandation":"1-Ouvrir le fichier de configuration de redis (elasticsearch.yml)<br>2-	Configurer la valeur listen/bind avec les adresses autorisées à solliciter la console du service"},
				{"type":"system", "description":"PAGE PAR DEFAUT APACHE TOMCAT","resume":"La page par défaut d’installation du serveur web est accessible","impact":"L’accessibilité à la page par défaut  du serveur web fournit des informations précieuses à un éventuel attaquant durant sa collecte d’informations.Elle peut révéler en fonction de la version utilisée de graves failles de sécurité pouvant aider à la compromission totale du système","riskrating":"Moyen", "recommandation":"Supprimer la page par défaut du serveur web ainsi que tous les assets associées(examples, guides, etc.)<br>Rediriger l’utilisateur vers une page d’érreur ou un projet tournant sur le serveur."},
				{"type":"system", "description":"SERVICE REDIS  ACCESSIBLE SANS AUTHENTIFICATION","resume":"accessibilité et possibilité de paramétrer entièrement et sans accès conditionné par  un challenge login/mot de passe le service redis. Redis est un système de gestion base de données clé-valeur scalable ayant la particularité d’utiliser la mémoire volatile (RAM) afin de fournir des performances très importantes ; dans certains cas il est utilisé comme un moyen de caching, de messagerie","impact":"Compromission totale du système. Par exemple l’exécution de la commande FLUSHALL aurait pour effet de supprimer toute la base de données du projet","riskrating":"Critique", "recommandation":"Restreindre l’appel à redis à des ip bien définies"},
				{"type":"system", "description":"COMPTE PAR DEFAUT ADMIN/ADMIN SUR MANAGER APACHE TOMCAT","resume":"Nous avons découvert lors de l’audit l’existence d’un compte accessible via le couple admin/admin","impact":"Un potentiel attaquant pourrait compromettre le système entier en sabotant la plupart des services et applications tournant sur le serveur en y injecter des scripts malveillants dans les projets afin de récupérer les mots de passe AD des utilisateurs par exemple","riskrating":"Critique", "recommandation":"Remplacer le mot de passe existant par un mot de passe conforme à la politique de sécurité OCI"},
				{"type":"system", "description":"DROITS ABUSIFS SUR LES REPERTOIRES ET FICHIERS SENSIBLES","resume":"Nous avons constaté lors de l’audit l’existence de droits abusifs sur les fichiers et répertoires hébergeant des informations sensibles","impact":"Un utilisateur bénéficiant d’un accès non autorisé au serveur pourrait consulter le contenu des informations sensibles, les utiliser, les divulguer","riskrating":"Critique", "recommandation":"Restreindre le répertoire du projet aux utilisateurs/services autorisés."},
				{"type":"system", "description":"DATE DU SYSTEME NON A JOUR","resume":"Nous avons remarqué que la date du système n’était pas cohérente","impact":"Un serveur avec un horodatage incohérent pourrait mettre la crédibilité de son activité en question , par exemple, toute les évidences de traçabilité, enregistrement de base de donnée, pourraient être compromises et donc de nul effet.","riskrating":"Elevé", "recommandation":"Mettre l’heure des serveurs indexés à jour."},
				{"type":"system", "description":"MISES A JOUR NON INSTALLEES","resume":"Nous avons remarqué que l’installation des mises à jour n’était pas effective.","impact":"Un système non à jour est exposé à toutes les vulnérabilité supérieures à la version courante","riskrating":"Elevé", "recommandation":"Nous recommandons d’activer la mise à jour automatique / Installer les dernières mises à jour"},
				{"type":"system", "description":"LICENCE NON ACTIVEE","resume":"Nous avons remarqué que le système n’était pas activé, pas de licence.","impact":"Un système qui n’a pas de licence n’a pas droit aux mises à jours donc exposé à des vulnérabilités","riskrating":"Nous recommandons d’activer le système", "recommandation":""},
				{"type":"system", "description":"ROUTAGE SOURCE DE PAQUETS IP ACTIVE","resume":"Durant l’audit nous avons détecté les paramétrages dangereux suivants :net.ipv4.conf.default.accept_source_route = 1","impact":"Ces paramétrages laissés par défaut augmentent la surface d’attaque notamment le routage frauduleux de paquets IP.","riskrating":"Elevé", "recommandation":"Nous recommandons la désactivation du routage source de paquets IP  afin que personne ne puisse nous dire quel chemin un paquet doit prendre: net.ipv4.conf.default.accept_source_route = 0 <br> En outre nous recommandons la désactivation de IPV6 si non utilisé :net.ipv6.conf.all.disable_ipv6 = 1"},
				{"type":"system", "description":"MAUVAISE CONFIGURATION SSH","resume":"La configuration du service SSH(Secure Shell) rend le service vulnérable.","impact":"Le mauvais paramétrage d’un service et en l’occurrence le SSH(Secure Shell) qui est un service pratiquement indispensable sur UNIX, l’expose à des risques pouvant entrainer la compromission du système entier notamment par  l’upload de fichiers malicieux par sftp, le brute forcing, remote login non autorisé","riskrating":"Elevé", "recommandation":"Nous recommandons  de dé commenter et de paramétrer efficacement les attributs de gestion des sessions clientes"},
				{"type":"system", "description":"FAIBLE POLITIQUE DE MOT DE PASSE","resume":"Durant l’audit nous avons constaté la possibilité de pouvoir créer un mot de passe faible, contraire à la politique de sécurité OCI","impact":"Un potentiel attaquant pourrait par une attaque par dictionnaire/brute-forcing accéder au portail Selfcare d’un utilisateur ne respectant pas la politique des mots de passe OCI","riskrating":"Elevé", "recommandation":"Forcer par une double validation (client/serveur) la création/modification d’un mot de passe selon la politique des mots de passe de OCI"},
				{"type":"system", "description":"SERVICE VULNERABLES ACTIFS","resume":"Durant l’audit nous avons détecté que des services vulnérables tels que FTP,TELNET étaient actifs","impact":"Les services identifiés sont vulnérables notamment à des écoutes de la part d’un attaquant, qui pourrait collecter des informations sensibles tels que les mots de passes et compromettre ainsi le système","riskrating":"Critique", "recommandation":"Nous recommandons :La désactivation des services vulnérables identifiés (FTP , TELNET)"},
				{"type":"system", "description":"OUTILS PROSCRITS DETECTES","resume":"Nous avons remarqué que certains outils permettant de réaliser des compilations de code, de téléchargement et exécution de scripts .","impact":"Ce genre d'outils s’ils ne sont pas nécessaires augmentent la surface d'attaque. Ils peuvent être utilisés par un attaquant.","riskrating":"Critique", "recommandation":"Nous recommandons <br> 	la suppression de tous les outils proscrits détectés non nécessaires au bon fonctionnement de l’application <br> 	Dans certains cas la suppression d’un outil peux forcer la suppression d’autres outils/services/logiciels Légitimes, dans ce cas il faudrait procéder à une suppression localisée seulement à l’outil proscrit(voir en pratique)."},
				{"type":"system", "description":"VERSION NOYAU OBSOLETE","resume":"Durant l’audit nous avons détecté une version obsolète du noyau.","impact":"Elévation de privilège, compromission totale du système","riskrating":"Critique", "recommandation":"Nous recommandons Mettre à jour le noyau Intégrer des paramètres visant à durcir le noyau"},
				{"type":"mobile-android", "description":"APPLICATION ENTIEREMENT DEBOGABLE","resume":"L’application mobile est entièrement débogagble","impact":"Une application mobile entièrement débogable conduit à une fuite de données importantes notamment des comptes de test, la structure des requêtes vers diverses api, etc.","riskrating":"Critique", "recommandation":"Retirer dans le code source toute ligne destinée à débugger des messages, requêtes"},
				{"type":"mobile-android", "description":"VERSION MINIMUM SDK ANDROID PERMISSIVE","resume":"La version minimum compatible du SDK Android relativement à l’application mobile est vulnérable au phénomène d’écrasement des permissions","impact":"L’écrasement de privilèges permet à un attaquant ayant préalablement procédé à un reverse engineering et accédé au fichier AndroidManifest.xml de pouvoir construire une application malveillante destinée à la version minimum du SDK, pour usurper l’identité de l’application légitime déjà installé sur le terminal de la victime même lorsque l’entièreté des permissions sont chiffrées","riskrating":"Elevé", "recommandation":"Nous recommandons de fixer la valeur minimum du SDK à 21"},
				{"type":"mobile-android", "description":"BACKUP DE L’APPLICATION AUTORISE","resume":"L’application autorise les backups","impact":"Un attaquant potentiel disposant du terminal, l’ayant volé ou profitant d’une faille locale pourrait sauvegarder l’entièreté des applications autorisant cette action .Il pourrait ainsi analyser à froid le contenu afin de rechercher des informations sensibles telles des données à caractère personnels, login/ mot de passe, token de connexion","riskrating":"Elevé", "recommandation":"Désactiver le backup de l’application"},
				{"type":"mobile-android", "description":"COMPOSANTS APPLICATIFS PERMISSIFS","resume":"L’application contient des composants applicatifs permissifs.","impact":"Des composants applicatifs permissifs sont exposés aux injections de contenus malicieux et fuites de données","riskrating":"Elevé", "recommandation":"Nous recommandons de définir des permissions durcies par des attributs de protection de niveau signature pour les composants concernés."},
				{"type":"mobile-android", "description":"REVERSE ENGINEERING","resume":"L’application est entièrement réversible et facilement lisible","impact":"Un attaquant pourrait exploiter cette vulnérabilité afin d’accéder à des informations sensibles tels que le code source ou encore  le fichier AndroidManifest.xml  contenant les permissions","riskrating":"Elevé", "recommandation":"l’utilisation d’outils destinés à obfusquer le code source tel que Proguard."},
				{"type":"mobile-android", "description":"FAIBLE MECANISME D’AUTORISATION","resume":"Les apis bien que conditionnant un accès par authentification souffrent en revanche d’un mécanisme d’autorisations faible","impact":"Un Utilisateur malveillant de l’application pourrait avoir accès à des informations personnelles, stratégiques, sensibles sur des concurrents","riskrating":"Critique", "recommandation":"De durcir le mécanisme d’autorisation par l’implémentation du json web tokens (JWT) par exemple"},
				{"type":"mobile-android", "description":"STOCKAGE LOCAL NON CHIFFRE","resume":"L’application stocke localement des informations sensibles non chiffrées","impact":"Un attaquant potentiel disposant du terminal, l’ayant volé ou subtilisé temporairement pourrait télécharger et ainsi analyser à froid le contenu stocké afin de rechercher des informations sensibles telles que les token d’authentification, les bases de données locales, etc.","riskrating":"Elevé", "recommandation":"Nous recommandons :<br> 	chiffrer les informations sensibles stockées localement (dans le terminal)"}
