{
	"projects":{
		"issues":["Réglementaire","Modernisation des infrastructures & BB","QoS & Expérience client","Conquérir le marché B2B","Sécurité ITN & Lutte contre la fraude","Digitalisation & Big data","OM & nouveaux services"],
		"programs":["Evolution Réseau Fixe","SI Support","Infrastructures et virtualisation","ICT","Digital","Sécurité","Orange Money","Convergence fixe mobile","Evolution Réseau Mobile","Développement des services","Autre"],
		"team":["Colombe COULIBALY","Fatim NDIONNE","Emmanuel RIEHL","Simoney TOUFOUO","Eric ABOA","François Amon DABY","Emmanuel KACOU"],
		"spocs":["Emmanuel RIEHL","Simoney TOUFOUO","Emmanuel KACOU"],
		"team_roles":["Chef Projet","Interface Metier","Interface Technique","SPOC SecByDesign","Responsable Etude"],
		"years":["2017","2018","2019","2020","2021","2022","2023","2024","2025","2026","2027","2028","2029","2030","2031","2032","2033","2034","2035","2036","2037"],
		"semesters":["S1","S2"],
		"priorities":["P0","P1","P2"],
		"governances":["Full Track","Fast Track","Super Fast Track"],
		"DTSI":["DSI","DR","DTSI"],
		"carriers":["AMOA","BI","CLOUD","CORE","DSPF","EnvTech","INFRA","IP","SECU","SVA","TRANS","AUTRE"],
		"customers":["DF","DG/STRATEGIE DRDI DAL DM","DI","DJR","DM","DOB","DRDI","DRH/DF","DS","DTSI","DXC","OMCI","PMO DG","DJR"]
	},
	"project_accompaniments":{
		"status":["Etude","Execution","Production","Tests","Fin des tests","Non démarré","Suspendu","Annulé"],
		"types":["Point","Indisponibilité","Alerte"]
	},
	"project_deliverables":{
		"reports":{
			"vulnerabilities":[
				{"type":"web","description":"COMMUNICATIONS NON CHIFRREES SUR L’ENSEMBLE DE L’APPLICATION","resume":"Les communications sur l’ensemble de l’application ne sont pas chiffrées","impact":"Un attaquant potentiel ayant un accès au réseau interne et se mettant dans les dispositions nécessaires pourrait écouter l’entièreté des communications des utilisateurs de l’application et pourrait récupérer des informations plus ou moins sensibles pouvant être utilisés dans le cadre d’un phishing.","riskrating":"eleve","recommandation":"Un attaquant potentiel ayant un accès au réseau interne et se mettant dans les dispositions nécessaires pourrait écouter l’entièreté des communications des utilisateurs de l’application et pourrait récupérer des informations plus ou moins sensibles pouvant être utilisés dans le cadre d’un phishing."},
				{"type":"web","description":"MAUVAISE IMPLEMENTATION COOKIE","resume":"une mauvaise implémentation de la directive set-Cookie après une authentification avec l’attribut « secure » manquant dans la syntaxe proposée dans la réponse serveur.","impact":"L’attribut secure force la diffusion du cookie uniquement via des échanges sécurisés ce qui rend difficile la lecture, le vol et le rejeu du cookie de session dans un traffic écouté par un éventuel attaquant","riskrating":"eleve","recommandation":"Implémenter l’attribut secure lors de la génération des cookies servant à accéder à des plateformes régies par une authentification.Implémenter l’attribut HTTPOnly  afin de ne partager le cookie uniquement que depuis une requête http (et non accessible via javascript)Implémenter  l’attribut SameSite avec la valeur SameOrigin afin de restreindre le partage des cookies uniquement dans le même domaine"},
				{"type":"web","description":"FICHIER ROBOTS TXT DETECTE","resume":"Le fichier robots.txt est présent à la racine ou dans un autre répertoire du projet web","impact":"Le fichier robots txt facilite l’indexation des pages web, cependant dans le contexte d’une application sensible il représente un révélateur de chemins d’accès comme les urls d’administration , des répertoires sensibles aidant un potentiel attaquant lors de sa collecte d’information. Il n’est donc pas utile dans le cas d’applications internes vu que la problématique de référencement est obsolète.","riskrating":"moyen","recommandation":"Suppression du fichier robots.txt"},
				{"type":"web","description":"FICHIER CHANGELOG.TXT DETECTE","resume":"Le fichier CHANGELOG.txt est présent à la racine ou dans un autre répertoire du projet web.","impact":"Le fichier CHANGELOG.txt contient l’historique des mises à jour réalisées dans le CMS/Framwork. Il pourrait service à l’attaquant afin d’énumérer explicitement la version ainsi que tous les modules installés manuellement ou via un outil dédié.","riskrating":"moyen","recommandation":"Suppression du fichier robots.txt"},
				{"type":"web","description":"CODE COMMENTE","resume":"Nous avons remarqué durant Les audits la présence d’instructions de programmation commentés dans certaines réponses du serveur.","impact":"Les commentaires généralement utiles dans un objectif de documentation/débogage de l’application peuvent aussi servir de manuel de compréhension de la logique de programmation implémentée notamment dans un environnement de dev et de préprod, et donc dans certains cas révéler des login et mots de passe à des comptes de test actif ou des portails d’administration.","riskrating":"moyen","recommandation":"La suppression des sections de code commentés."},
				{"type":"web","description":"CHAMP DE MOT DE PASSE AVEC L’ATTRIBUT AUTOCOMPLETE ACTIVE","resume":"L’attribut autocomplete activé sur un champ de mot de passe.","impact":"Si un utilisateur choisi de sauvegarder ses identifiants de connexion, elles peuvent être accessible à un utilisateur tiers, ayant un accès physique sur la machine bénéficiant de droits d’exécution de scripts dans le cas d’un système multiutilisateur ou d’un script malveillant destiné à dumper les accès sauvegardés par le/les browsers de la machine infecté.","riskrating":"moyen","recommandation":"Mettre l’attribut autocomplete à OFF sur les champs jugés pertinents"},
				{"type":"web","description":"POLITIQUE DE SECURISATION DE CONTENU (CSP) NON IMPLEMENTE ","resume":"La politique de sécurisation de contenu est une couche additionnelle aidant à mitiger la plupart des attaques XSS. Elle est ici non implémentée","impact":"Il n'y a pas d'impact direct de la non implémentation de CSP sur votre site Web. Cependant, si votre site Web est vulnérable à une attaque de type Cross-site Scripting, le CSP peut empêcher l'exploitation de cette vulnérabilité. En ne mettant pas en œuvre le CSP, vous manquerez cette couche supplémentaire de sécurité","riskrating":"moyen", "recommandation":"Ajouter un header X-XSS-Protection: 1; mode=block dans les réponses serveur"},
				{"type":"web","description":"ENTETE X-XSS-PROTECTION NON IMPLEMENTEE","resume":"Entête X-XSS-Protection non implémentée","impact":"L'en-tête de réponse HTTP X-XSS-Protection est une fonctionnalité d'Internet Explorer, de Chrome et de Safari qui empêche le chargement des pages lorsqu'elles détectent des attaques XSS (Cross-Site Scripting).. En revanche son implémentation est préconisée dans le cadre de l’utilisation de vieux navigateurs, cette fonctionnalité étant gérée dans les browsers modernes via le header Content-Security-Policy.","riskrating":"moyen", "recommandation":"Implémenter l'entête CSP"},
				{"type":"web","description":"DIVULGATION DES VERSIONS DE TECHNOLOGIES UTILISEES","resume":"L’application divulgue les versions des technologies clientes/serveur utilisées.","impact":"Les informations des technologies associées aux versions utilisées fournissent des informations à un éventuel attaquant durant sa collecte d’informations.","riskrating":"moyen", "recommandation":"La minification  des scripts des ressources utilisées côté client"},
				{"type":"web","description":"PHISHING PAR NAVIGATION SUR DE NOUVEAUX ONGLETS","resume":"Existence de liens pointant vers des ressources externes et provoquant l’ouverture dans un nouvel onglet avec la directive target= _blank mais  n’implémentant pas la directive noopener.","impact":"L’ouverture au clic d’une nouvelle fenêtre pointant vers des sites externes sur des liens à l’intérieur du projet n’implémentant la directive noopener autorise la ressource cible sachant l’origine de la requête pourrait rediriger silencieusement l’utilisateur vers une plateforme malicieuse (par exemple de phishing sur cette origine) sans qu’il ne s’en rende compte.","riskrating":"eleve", "recommandation":"La minification  des scripts des ressources utilisées côté client"},
				{"type":"web","description":"POLITIQUE D’INTEGRITE DES SOUS RESSOURCES(SRI) NON IMPLEMENTEE","resume":"Nous avons remarqué l’absence de mesures d’implémentation de la politique d’intégrité des sous ressources.","impact":"La politique d’intégrité des sous ressources permet de s’assurer via des comparaison de hash, que le/les script(s) chargé(s) depuis un fournisseur distant à l’image d’un CDN(Content Delivery Network) sont complètement intègres et ne sont modifiés volontairement/involontairement par le fournisseur durant leur chargement.","riskrating":"moyen","recommandation":"pour l’ensemble des ressources identifiées :ajouter un attribut integrity à la balise script avec le type de hash(sha256, sha384 ou  sha512) et la valeur du hash précédée du symbole–ajouter un attribut crossorigin avec la valeur anonymous, cet attribut interdit au navigateur d’échanger des cookies et quelconques autres informations d’authentification (jwt, etc .) associées au requêtes."},
				{"type":"web","description":"POLITIQUE HSTS NON IMPLEMENTEE","resume":"La politique HSTS (header) n’est pas implémentée","impact":"L’ouverture au clic d’une nouvelle fenêtre pointant vers des sites externes sur des liens à l’intérieur du projet n’implémentant la directive noopener autorise la ressource cible sachant l’origine de la requête pourrait rediriger silencieusement l’utilisateur vers une plateforme malicieuse (par exemple de phishing sur cette origine) sans qu’il ne s’en rende compte.","riskrating":"eleve", "recommandation":"Implémenter la directive http-Strict-Transport-Security dans les réponses du serveur web."},
				{"type":"web","description":"MAUVAISE STRATEGIE D’UPLOAD","resume":"La stratégie d’upload implémentée augmente le risque de compromission du système.","impact":"Une mauvaise stratégie d’upload expose l’application à des attaques par déni de service par l’upload de fichiers très lourd sollicitant considérablement les ressources du serveur, l’injection de fichiers malveillants dont la compilation et/ou l’exécution pourrait entrainer la compromission entière du système.","riskrating":"eleve", "recommandation":"Vérifier la taille et la signature des fichiers objets de l’upload côté client et côté serveur, cela permet d’une part de réduire les faux positifs résultant d’erreurs dans l’utilisation  de la solution et de l’autre de s’assurer que l’upload est conforme."},
				{"type":"web","description":"CROSS SITE REQUEST FORGERY","resume":"L’application est vulnérable aux CSRF (Cross Site Request Forgery)","impact":"Les CSRF ou XSRF permettent de faire exécuter sans s’en qu’ils s’en rendent compte des actions soit d’administrations à des utilisateurs disposant de privilèges élevés dans une application donné par exemple la création d’un utilisateur, la réinitialisation d’un mot de passe ou soit à de simples utilisateur  telle que l’envoi d’argent à un tiers s’avérant être une personne malveillante.","riskrating":"eleve", "recommandation":"Génerer un token unique avec une très grande entropie  sur les pages intégrant des formulaires sensibles expirant après chaque soumission des formulaires en questionSoumettre les formulaires en POSTIntégrer des popups de confirmation de certaines actions sensibles(optionnel) Intégrer des captcha via des plugins ou self développement  aux pages intégrant des formulaires sensibles."},
                {"type":"web","description":"XSS STOCKE","resume":"Le site est vulnérable au Cross Site Scripting (XSS) stocké.","impact":"Le XSS stocké est un problème dangereux qui a de nombreux vecteurs d'exploitation du fait de la persistance des informations injectées, dont certains incluent :Les informations sensibles de la session de l'utilisateur, telles que les cookies, peuvent être volées par transfert transparent vers un serveur de récupération. XSS peut faire tourner en tâche de fond des scripts malveillants tels des backdoors, injecter des commandes OS, etc.Le site peut être redirigé vers un nouvel emplacement, endommagé ou utilisé comme site d'hameçonnage","riskrating":"critique","recommandation":"Réaliser un double validation (côté client/côté serveur) de toute valeur issue de champ de formulaire soumis par l’utilisateur afin de s’assurer que l’information est conforme au type, à la longueur, à la signature attendue Contextualiser l’affichage de contenu sur UI par des fonctions spéciales permettant d’échapper les caractères interdits  ou l’équivalent dans votre moteur de génération de contenus"}
			],
			"decisions":["Go","NoGo","Go sous réserve"],
			"types":["web","system","mobile-android"],
			"severities":[{"rating":"critique","literal_rating":"Critique"},{"rating":"eleve","literal_rating":"Elevé"},{"rating":"moyen","literal_rating":"Moyen"},{"rating":"faible","literal_rating":"Faible"}],
			"categories":[{"category":"mobile","literal_category":"Mobile"},{"category":"web","literal_category":"Web"},{"category":"configuration","literal_category":"Configuration"},{"category":"reseau","literal_category":"Réseaux"},{"category":"password","literal_category":"Mot de Passe"},{"category":"tech","literal_category":"Technologies"}],
			"systems":[{
				  "os":"Ubuntu", 
				  "versions":["14LTS","16LTS","18LTS"]
				},
				{
					"os":"Debian",
					"versions":["7 (Wheezie)","8 (Jessie)","9 (Stretch)"]
				},
				{
					"os":"CentOS",
					"versions":["6","7"]
				},
				{
					"os":"Windows Server",
					"versions":["2003","2008 R2 Sp1","2008 R2 Sp2","2012","2012 R2 Sp1","2012 R2 Sp2","2016"]
				}],
			"vulnerability_report_types":["Rapport Audit","Rapport Vérification"]
		},
		"types":["Rapport Audit","Rapport Vérification","Fiche Corrections","Fiche Exigences","Fiche Projet","Fiche Sauvegarde","Architecture","Prérequis Audit","EB","Présentations","Autre"]
	}	

}